<a href="https://colab.research.google.com/github/kjchew/kjchew.github.io/blob/master/PandasTutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [2]:
np.random.seed(23)

#Series

In [4]:
series_labels = ['USA','China','France', 'Germany']
mylist = [1,2,3, 4]
arry = np.array([10,20,30])
d = {'a':10, 'b':200, 'c':100}

In [5]:
ser1 = pd.Series(mylist, index=series_labels)

In [6]:
ser1['China']

2

In [7]:
labels = ['W','X','Y','Z']
idx = ['A','B', 'C','D','E']
df = pd.DataFrame(data=randn(5,4), index=idx, columns=labels)
df

          W         X         Y         Z
A  0.666988  0.025813 -0.777619  0.948634
B  0.701672 -1.051082 -0.367548 -1.137460
C -1.322148  1.772258 -0.347459  0.670140
D  0.322272  0.060343 -1.043450 -1.009942
E  0.441736  1.128877 -1.838068 -0.938769

In [8]:
res1 = df[df['X']>0]
res1

          W         X         Y         Z
A  0.666988  0.025813 -0.777619  0.948634
C -1.322148  1.772258 -0.347459  0.670140
D  0.322272  0.060343 -1.043450 -1.009942
E  0.441736  1.128877 -1.838068 -0.938769

In [9]:
res2 = df[(df['X']>0) & (df['W']>0)]
res3 = df[(df['X']>0) | (df['W']>0)]

In [10]:
df['XX'] = randn(5)
df

          W         X         Y         Z        XX
A  0.666988  0.025813 -0.777619  0.948634 -0.201841
B  0.701672 -1.051082 -0.367548 -1.137460  1.045371
C -1.322148  1.772258 -0.347459  0.670140  0.538162
D  0.322272  0.060343 -1.043450 -1.009942  0.812119
E  0.441736  1.128877 -1.838068 -0.938769  0.241106

In [11]:
df.drop('XX', axis=1)
df['State'] = 'Selangor Kelantan Melaka Johor Trengganu'.split()
df.set_index('State')

                  W         X         Y         Z        XX
State
Selangor   0.666988  0.025813 -0.777619  0.948634 -0.201841
Kelantan   0.701672 -1.051082 -0.367548 -1.137460  1.045371
Melaka    -1.322148  1.772258 -0.347459  0.670140  0.538162
Johor      0.322272  0.060343 -1.043450 -1.009942  0.812119
Trengganu  0.441736  1.128877 -1.838068 -0.938769  0.241106

#Multi-Index DF

In [12]:
outer = ['2019', '2019', '2019', '2020', '2020', '2020']
inner = ['Revenue', 'Profit', 'Cost','Revenue', 'Profit', 'Cost']
hier_index = list(zip(outer, inner))
df_index = pd.MultiIndex.from_tuples(hier_index)

In [13]:
df = pd.DataFrame(randn(6,2), index=df_index, columns=['Google', "FB"])

In [14]:
df

                Google        FB
2019 Revenue -0.952510 -0.136267
     Profit   1.267248  0.173634
     Cost    -1.223255  1.415320
2020 Revenue  0.457711  0.728876
     Profit   1.968435 -0.547788
     Cost    -0.679418 -2.506230

In [15]:
df.loc['2019'].loc['Revenue']

Google   -0.952510
FB       -0.136267
Name: Revenue, dtype: float64

##Multi-index Column Namme

In [16]:
df.index.names=['FY', 'Data']
df

                Google        FB
FY   Data
2019 Revenue -0.952510 -0.136267
     Profit   1.267248  0.173634
     Cost    -1.223255  1.415320
2020 Revenue  0.457711  0.728876
     Profit   1.968435 -0.547788
     Cost    -0.679418 -2.506230

###Cross Section

In [17]:
df.xs('Revenue', level='Data')

        Google        FB
FY
2019 -0.952510 -0.136267
2020  0.457711  0.728876

####Retrieve the Revenue for Google for Year 2020

In [20]:
df.xs('Revenue', level='Data').loc['2020']['Google']

0.4577109797826604

##Missing Data

In [27]:
sample_data1 = {"A": [1,2, np.nan], "B":[4,np.nan, np.nan], "C":[7,8, 9]}
df_md = pd.DataFrame(sample_data1)

In [28]:
df_md

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8
2  NaN  NaN  9

In [29]:
df_md.dropna()

     A    B  C
0  1.0  4.0  7

In [30]:
df_md.dropna(axis=1)

   C
0  7
1  8
2  9

In [31]:
df_md.dropna(thresh=2)

     A    B  C
0  1.0  4.0  7
1  2.0  NaN  8

In [34]:
df_md.fillna(value=df_md['A'].mean())

     A    B  C
0  1.0  4.0  7
1  2.0  1.5  8
2  1.5  1.5  9

#Group by

In [44]:
company_data = {'Company': ['G','G','G','MS','MS','MS','FB','FB','FB'],
                'Staff':['John','Marie','Ali','Beckum','Dave','Sharp','Ana','Lydia','Nicole'],
                'Sales': [np.random.randint(1,20) for i in range(1,10)]}
comp_df = pd.DataFrame(company_data)
comp_df

  Company   Staff  Sales
0       G    John      7
1       G   Marie      6
2       G     Ali      8
3      MS  Beckum      5
4      MS    Dave     17
5      MS   Sharp      7
6      FB     Ana     10
7      FB   Lydia     17
8      FB  Nicole     16

In [47]:
comp_df.groupby('Company').describe()

        Sales
        count       mean       std   min   25%   50%   75%   max
Company
FB        3.0  14.333333  3.785939  10.0  13.0  16.0  16.5  17.0
G         3.0   7.000000  1.000000   6.0   6.5   7.0   7.5   8.0
MS        3.0   9.666667  6.429101   5.0   6.0   7.0  12.0  17.0

####Retrieve the mean of Sales for FB

In [54]:
comp_df.groupby('Company').describe()['Sales']['mean'].loc['FB']

14.333333333333334

In [56]:
comp_df.groupby('Company').describe().transpose()

Company             FB    G         MS
Sales count   3.000000  3.0   3.000000
      mean   14.333333  7.0   9.666667
      std     3.785939  1.0   6.429101
      min    10.000000  6.0   5.000000
      25%    13.000000  6.5   6.000000
      50%    16.000000  7.0   7.000000
      75%    16.500000  7.5  12.000000
      max    17.000000  8.0  17.000000

##Merging, Joining, Concatenating

In [57]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                            'B': ['B4', 'B5', 'B6', 'B7'],
                           'C': ['C4', 'C5', 'C6', 'C7'],
                           'D': ['D4', 'D5', 'D6', 'D7']},
                            index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                            'B': ['B8', 'B9', 'B10', 'B11'],
                           'C': ['C8', 'C9', 'C10', 'C11'],
                       'D': ['D8', 'D9', 'D10', 'D11']},
                         index=[8, 9, 10, 11])

In [58]:
# Concat on axis 0
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [59]:
#Concat on axis 1
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [60]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                   'A': ['A0', 'A1', 'A2', 'A3'],
                         'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                              'C': ['C0', 'C1', 'C2', 'C3'],
                             'D': ['D0', 'D1', 'D2', 'D3']})
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [61]:
left = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3'],
                    'key2': ['K0', 'K1', 'K0', 'K1'],                     
                   'A': ['A0', 'A1', 'A2', 'A3'],
                         'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3'],                     
                    'key2': ['K0', 'K0', 'K0', 'K0'],                     
                              'C': ['C0', 'C1', 'C2', 'C3'],
                             'D': ['D0', 'D1', 'D2', 'D3']})
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K2   K0  A2  B2  C2  D2

In [63]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                        'B': ['B0', 'B1', 'B2']},
                        index=['K0', 'K1', 'K2']) 
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                        'D': ['D0', 'D2', 'D3']},
                         index=['K0', 'K2', 'K3'])
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [64]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

##Operations

In [3]:
op_df = pd.DataFrame({"col1":[1,2,3,4], "col2":[444,555,666,555],
                      "col3": ["abc", "def","ghi","xyz"]})
op_df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   555  xyz

In [5]:
#find Unique values
op_df['col2'].unique()

array([444, 555, 666])

In [6]:
#find number of unique values
op_df['col2'].nunique()

3

In [8]:
#find the count for value
op_df['col2'].value_counts()

555    2
666    1
444    1
Name: col2, dtype: int64

In [9]:
#apply function to column
op_df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [10]:
op_df.drop('col1', axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   555  xyz

In [11]:
op_df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [12]:
op_df.index

RangeIndex(start=0, stop=4, step=1)

In [13]:
op_df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
1     2   555  def
3     4   555  xyz
2     3   666  ghi

In [14]:
op_df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [16]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [17]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

##Data Input and Output

In [20]:
df = pd.read_csv('./sample_data/california_housing_test.csv')

In [21]:
df.to_csv('./sample_data/my_california_test.csv')

In [28]:
df = pd.read_excel('./sample_data/Excel_Sample.xlsx', sheet_name='Sheet1')
df

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [30]:
data = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")

#Exercise

In [35]:
banklist_data = pd.read_html("https://www.fdic.gov/bank/individual/failed/banklist.html")
banks = banklist_data[0]

In [36]:
#Show the head of the df
banks.head()

                          Bank Name  ...       Closing Date
0              The First State Bank  ...      April 3, 2020
1                Ericson State Bank  ...  February 14, 2020
2  City National Bank of New Jersey  ...   November 1, 2019
3                     Resolute Bank  ...   October 25, 2019
4             Louisa Community Bank  ...   October 25, 2019

[5 rows x 6 columns]

In [39]:
#Column names
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date'],
      dtype='object')

In [40]:
#How many states (ST) are represented in this data set
banks['ST'].nunique()

44

In [41]:
#Array of all the states in the data set
banks['ST'].unique()

array(['WV', 'NE', 'NJ', 'OH', 'KY', 'TX', 'IL', 'KS', 'WI', 'LA', 'UT',
       'AR', 'GA', 'PA', 'TN', 'WA', 'CO', 'PR', 'FL', 'MN', 'CA', 'MD',
       'OK', 'SC', 'VA', 'ID', 'CT', 'AZ', 'NV', 'NC', 'MO', 'AL', 'MI',
       'IN', 'IA', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'NH', 'HI'],
      dtype=object)

In [49]:
# top 5 states with the most failed banks?
banks.groupby('ST').count()['Bank Name'].sort_values(ascending=False).head()

ST
GA    93
FL    75
IL    69
CA    41
MN    23
Name: Bank Name, dtype: int64

In [60]:
# top 5 acquiring instutions
banks.groupby('Acquiring Institution').count().sort_values('Bank Name', ascending=False)['Bank Name'].head()
banks['Acquiring Institution'].value_counts().iloc[:5]

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

In [68]:
#How many banks has the State Bank of Texas acquired? and in Texas
banks[(banks['Acquiring Institution'] == 'State Bank of Texas') & (banks['City']=='Dallas')]

                          Bank Name    City  ... Acquiring Institution  Closing Date
458  Millennium State Bank of Texas  Dallas  ...   State Bank of Texas  July 2, 2009

[1 rows x 6 columns]

In [76]:
banks[banks['ST']=='CA'].groupby('City').count().sort_values('Bank Name', ascending=False)['Bank Name'].iloc[:1]

City
Los Angeles    4
Name: Bank Name, dtype: int64

In [84]:
#failed bank don't have the word "Bank" in their name
sum(banks['Bank Name'].apply(lambda x: 'Bank' not in x))

14

In [87]:
#bank name start with 'S'
sum(banks['Bank Name'].apply(lambda x: x.startswith('S')))

54

In [89]:
#banks with CERT < 20000
banks[banks['CERT']>20000].count()['CERT']

423

In [90]:
#bank names consist of just two word
sum(banks['Bank Name'].apply(lambda x: len(x.split())==2))

113

In [106]:
#How many banks closed in the year 2008
sum(banks['Closing Date'].apply(lambda x: x[-4:] == '2008'))
sum(pd.to_datetime(banks['Closing Date']).apply(lambda x : x.year == 2008))

25